notes/intergroup/2012-01-10.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Intergroup meeting notes, 2012-01-10:</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Intergroup meeting notes, 2012-01-10:"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-10 18:55:09 PST"/>
<meta name="author" content="David Lindes"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Intergroup meeting notes, 2012-01-10:</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Attendees</a></li>
<li><a href="#sec-2">2 Agenda</a></li>
<li><a href="#sec-3">3 Budget</a>
<ul>
<li><a href="#sec-3-1">3.1 budget proposals</a></li>
<li><a href="#sec-3-2">3.2 What to do?</a></li>
<li><a href="#sec-3-3">3.3 Food Not Bombs - $130</a></li>
<li><a href="#sec-3-4">3.4 Outreach - $50</a></li>
<li><a href="#sec-3-5">3.5 Morale - $200</a></li>
<li><a href="#sec-3-6">3.6 City Hall - $120</a></li>
<li><a href="#sec-3-7">3.7 Summary</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Group status</a>
<ul>
<li><a href="#sec-4-1">4.1 Food not bombs</a></li>
<li><a href="#sec-4-2">4.2 Environmental Justice</a></li>
<li><a href="#sec-4-3">4.3 ICT</a></li>
<li><a href="#sec-4-4">4.4 Media</a></li>
<li><a href="#sec-4-5">4.5 Gender Equality Caucus</a>
<ul>
<li><a href="#sec-4-5-1">4.5.1 Teach-in:</a></li>
<li><a href="#sec-4-5-2">4.5.2 Content</a></li>
</ul>
</li>
<li><a href="#sec-4-6">4.6 Bring Diaz Down</a>
<ul>
<li><a href="#sec-4-6-1">4.6.1 March for Bring Diaz Down</a></li>
<li><a href="#sec-4-6-2">4.6.2 Contact for the ACLU?</a></li>
</ul>
</li>
<li><a href="#sec-4-7">4.7 Process and Facilitation</a></li>
<li><a href="#sec-4-8">4.8 Medical</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Proposals and announcements</a>
<ul>
<li><a href="#sec-5-1">5.1 Rise and De-colonize</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1 National Latino Activists Day</a></li>
<li><a href="#sec-5-1-2">5.1.2 United Farm Workers action against Dairigold</a></li>
<li><a href="#sec-5-1-3">5.1.3 Requests for money</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Attendees</h2>
<div class="outline-text-2" id="text-1">


<ul>
<li>Norm, Occupy Chaplains
</li>
<li>Sonia, Supply &amp; Storage (had to leave early, so only here for part
  of the meeting)
</li>
<li>David L. (note taker), Media
</li>
<li>Aliana, Media
</li>
<li>Duff, Environmental Justice
</li>
<li>Bang, Food Not Bombs &amp; Food Group
</li>
<li>Stian, ICT
</li>
<li>Mike, Medical
</li>
<li>Kristin, Gender Equality Caucus &amp; Bring Diaz Down
</li>
<li>Carol, Process and Facilitation
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Agenda</h2>
<div class="outline-text-2" id="text-2">


<ul>
<li>Budget approvals
</li>
<li>Group status
</li>
<li>Proposals and announcements
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Budget</h2>
<div class="outline-text-2" id="text-3">


<p>
Very little detail on there, merely the following:
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> budget proposals</h3>
<div class="outline-text-3" id="text-3-1">


<p>
quoted verbatim from:
<a href="http://occupyseattle.org/resource/weekly-budget-proposals">http://occupyseattle.org/resource/weekly-budget-proposals</a>
</p>



<pre class="example">The following workgroup budgets were proposed at the 1/9/12 intergroup meeting --

Food Not Bombs - $130
Outreach - $50
Morale - $200
City Hall - $120
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> What to do?</h3>
<div class="outline-text-3" id="text-3-2">


<p>
We don't currently have anyone from Finance here, so we don't know our
balance or anything.
</p>
<p>
There's a belief that if the budget made it online, then that means it
was approved at the prior day's meeting.
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Food Not Bombs - $130</h3>
<div class="outline-text-3" id="text-3-3">


<p>
since we have a representative here, getting details from that.
</p>
<p>
Budget has been decreasing at a purported 20% per week
</p>
<ul>
<li>$60 on gas, to transport receipts of free vegetables that we collect
</li>
</ul>

<p>from around town.
</p><ul>
<li>$10 per day for each kitchen that cooked.  Thus $70.
</li>
</ul>


<p>
Proposal to approve the Food Not Bombs budget.
</p>
<p>
Budget approved without opposition.
</p>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Outreach - $50</h3>
<div class="outline-text-3" id="text-3-4">


<p>
Presumed to be for miscellaneous expenses.
</p>
<p>
Proposal to approve this.  Seconded.
</p>
<p>
Budget approved without opposition.
</p>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Morale - $200</h3>
<div class="outline-text-3" id="text-3-5">


<p>
Originally requested for $400, and Intergroup asked that they break it
up into $200 allotments.  These are for "Benefit" events, and would be
expected to be re-paid.
</p>
<p>
Proposal to approve this.  Seconded.
</p>
<p>
Budget approved without opposition.
</p>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> City Hall - $120</h3>
<div class="outline-text-3" id="text-3-6">


<p>
We've been told that they have already had their request satisfied,
because Engineering canceled their budget and gave $180 to City
Hall, and they're required to have a receipt by Friday.
</p>
<p>
No action taken.
</p>
</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Summary</h3>
<div class="outline-text-3" id="text-3-7">


<p>
$380 approved.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Group status</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Food not bombs</h3>
<div class="outline-text-3" id="text-4-1">


<p>
Have been moving towards a 4-day, scaled-down menu.  Now up to 7 days
a week, for GAs, action days, etc.  They need to re-assess things&hellip;
They request to cut things back down to 4 days of GA.
</p>
<p>
They're going to stay on the schedule until it costs them more.
They're just expressing a financial concern, and that they will most
likely scale back to the previous schedule.  Will most likely stay at
the $130 weekly budget.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Environmental Justice</h3>
<div class="outline-text-3" id="text-4-2">


<p>
Would like to invite everyone to an event:
</p>
<p>
Protest event against the Seattle Steam Incinerator (to try to shut it down)
</p>
<p>
Starting at noon, Saturday, February 11th, 2012 (2012-02-11), at
Westlake Park.
</p>
<p>
Then marching to Victor Steinbrook, bringing tents, with intention to
occupy over night with round-the-clock teach-ins, "die-ins", and
smaller direct actions within the broader action.
</p>
<p>
They anticipate requesting $100, mainly for flyers.  They've got a
good discount on flyers from Golem Printing.
</p>

<p>
Question: Is there any access to electricity &ndash; perhaps battery or
pedal-powered options or something for running a computer and
projector.
</p>
<p>
Supply and Storage is referenced as having Marine Batteries, and other
resources will be given off-line.
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> ICT</h3>
<div class="outline-text-3" id="text-4-3">


<p>
ICT will be meeting on Friday, to talk about a website re-design.
2012-01-13, 6:00pm.
</p>
<p>
They request that any ideas for what should be included in the
re-design, or considered in it, be e-mailed to ICT before hand, so
they can consider them in advance of and at their meeting.
</p>
<p>
occupyseattleict@gmail.com
</p>
<p>
Also, just a request that people remember to use the intergroup
mailing list, especially for minutes and such.
</p>
<p>
Details, archives, subscription, etc. at:
</p>
<p>
<a href="http://lists.occupyseattle.org/cgi-bin/mailman/listinfo/intergroup">http://lists.occupyseattle.org/cgi-bin/mailman/listinfo/intergroup</a>
</p>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Media</h3>
<div class="outline-text-3" id="text-4-4">


<p>
Media will be covering the following marches this month:
</p>
<ul>
<li>John Diaz, January 14th
</li>
<li>Martin Luther King, Jr. Day, January 16th
</li>
<li>Occupy The Courts / Citizens Ignited against Citizens United,
  January 20th and 21st.  This will be covered with a reporting team,
  similar to what might be expected from a TV media outlet.
</li>
</ul>


<p>
If there are other events that need covering, please contact media
via e-mail to: occupyseattle.media@gmail.com
</p>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Gender Equality Caucus</h3>
<div class="outline-text-3" id="text-4-5">



</div>

<div id="outline-container-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> Teach-in:</h4>
<div class="outline-text-4" id="text-4-5-1">


<p>
They're having an all-day teach in, Sunday, January 22nd (2012-01-22).
</p>
<p>
Location and exact time is TBD.
</p>
<p>
Topics to include at least:
</p>
<ul>
<li>Reproductive Oppression
</li>
<li>Human Trafficking, anti-slavery
</li>
<li>Gender Binary (including Culture Jamming &ndash; how we've been trained
  to think in the Gender Binary)
</li>
</ul>


<p>
People can come for one or all of these topics.
</p>
</div>

</div>

<div id="outline-container-4-5-2" class="outline-4">
<h4 id="sec-4-5-2"><span class="section-number-4">4.5.2</span> Content</h4>
<div class="outline-text-4" id="text-4-5-2">


<p>
There's a request from ICT for content &ndash; writings, or whatever --
that they can post on the Occupy Seattle Facebook page.
</p>
<p>
ICT is referred to check on:
</p>
<p>
<a href="http://www.facebook.com/occupyseattlegenderequality">http://www.facebook.com/occupyseattlegenderequality</a>
</p>
<p>
And GEC will send to occupyseattleict@gmail.com
</p>
</div>
</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Bring Diaz Down</h3>
<div class="outline-text-3" id="text-4-6">



</div>

<div id="outline-container-4-6-1" class="outline-4">
<h4 id="sec-4-6-1"><span class="section-number-4">4.6.1</span> March for Bring Diaz Down</h4>
<div class="outline-text-4" id="text-4-6-1">


<p>
Starting 4pm, 23rd and Union, this Saturday, 2012-01-14.
</p>
<p>
They've made some torches, which will burn for about 20 minutes.
</p>
<p>
Medical is preparing to treat any burns for this.
</p>

</div>

</div>

<div id="outline-container-4-6-2" class="outline-4">
<h4 id="sec-4-6-2"><span class="section-number-4">4.6.2</span> Contact for the ACLU?</h4>
<div class="outline-text-4" id="text-4-6-2">


<p>
Wondering if there's a contact for the ACLU?  Their contact fell
through.
</p>
</div>
</div>

</div>

<div id="outline-container-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Process and Facilitation</h3>
<div class="outline-text-3" id="text-4-7">


<p>
There's going to be a large push to have new people do the work,
because they don't have enough people.
</p>
<p>
One volunteer spoke up.  They'd still like more.  Lots more.
</p>
</div>

</div>

<div id="outline-container-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> Medical</h3>
<div class="outline-text-3" id="text-4-8">


<p>
They will have street medics at the Bring Diaz Down march, and also
the People Ignited Against Citizens United event.
</p>
<p>
Also, making a call that if anyone has any direct actions that they're
planning, that they would like medics to be at, please e-mail:
occupyseattlestreetmedics@gmail.com.
</p>
<p>
Unsure about their presence at the MLK march.
</p>
<p>
Request for them to put the February 11th Environmental Justice event
on their calendar.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Proposals and announcements</h2>
<div class="outline-text-2" id="text-5">



</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Rise and De-colonize</h3>
<div class="outline-text-3" id="text-5-1">



</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> National Latino Activists Day</h4>
<div class="outline-text-4" id="text-5-1-1">


<p>
This month, Rise and De-colonize, Hip Hop Occupy, will be having an
event, the 19th and 20th, for National Latino Activists Day.
</p>
</div>

</div>

<div id="outline-container-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> United Farm Workers action against Dairigold</h4>
<div class="outline-text-4" id="text-5-1-2">


<p>
About inhumane labor conditions.
</p>
<p>
Saturday, 2012-01-28.  Rise and De-colonize may assist with this event.
</p>
</div>

</div>

<div id="outline-container-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="section-number-4">5.1.3</span> Requests for money</h4>
<div class="outline-text-4" id="text-5-1-3">


<p>
They will likely also be requesting money for this.
</p>

<hr/>
<p>
Meeting adjourned, 2012-01-10, 18:41.

</p>
<hr/>
</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-01-10 18:55:09 PST</p>
<p class="author">Author: David Lindes</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
